Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: LwDITA does not have the purpose of replacing DITA XML.
zh_cn: 创建 LwDITA 的目的并非取代 DITA XML。

source: LwDITA Expands Beyond XML
zh_cn: LwDITA 不止 XML 一种格式

source: LwDITA Topical Conventions
zh_cn: LwDITA 的话题协定

source: LwDITA aims to simplify the DITA authoring and publishing experience with the minimum number of content components that were useful for the sectors and industries studied by members of the Lightweight DITA subcommittee.
zh_cn: LwDITA 的目标是提供轻量级 DITA 小组委员会成员研究出的对各部门和行业有用的最小数量的内容组件，以简化 DITA 创作和发布流程。

source: LwDITA also makes DITA publishing workflows more inclusive and accessible, as it accommodates non-XML authoring formats to address the needs of authors outside of the traditional technical documentation audience of DITA 1.0.
zh_cn: LwDITA还使DITA发布工作流更具包容性和可访问性，因为它适应了非XML创作格式，以满足DITA 1.0的传统技术文档读者之外的作者的需求。

source: LwDITA and Information Mapping®: The Merger that
zh_cn: LwDITA 和信息映射®：没有合并，胜似合并

source: LwDITA includes components for representing the following types of lists:
zh_cn: LwDITA 的列表组件包含以下类型：

source: LwDITA is a topic-based architecture for tagging and structuring intelligent content using flexible markup options.
zh_cn: LwDITA 是一种基于话题的体系结构，使用灵活的标记选项为智能内容嵌套标签，创建结构。

source: LwDITA is a work in progress.
zh_cn: 轻量级DITA仍在不断演化。

source: LwDITA provides a low-barrier entry point for students in writing programs or humanities departments.
zh_cn: LwDITA 为学习写作或人文学科的学生提供了一个低门槛的入口。

source: LwDITA, like DITA XML, can be specialized into custom document and element types based on the needs of specific users.
zh_cn: 与 DITA XML 一样，LwDITA 可以 根据特定用户的需要专门化为特定的文档和元素类型。

source: LwDITA, likewise, is not a piece of software and does not come with an official “app,” and Creating Intelligent Content with Lightweight DITA does not require a specific software platform.
zh_cn: LwDITA也同样不是一款软件，也没有官方的“应用程序”，《使用轻量级DITA创建智能内容》没有指定特定的软件平台。

source: LwDITA, thus, can be a truly minimalist version of the standard, giving authors the structuring and publishing capabilities of DITA 1.3 in a reduced set of tags.
zh_cn: 因此，轻量级DITA可以成为标准的极简版本，它减少了标记的数量，为作者提供DITA 1.3的结构和发布功能。

source: LwDITA-aware tools could automate the process of generating a from a <title> and reduce repetition for human authors.
zh_cn: 支持 LwDITA 的工具可以自动利用<title>标签生成 ，并减少创作者的重复劳动。

source: MDITA
zh_cn: MDITA 格式

source: MDITA is designed for users who want to write structured content with the minimum of overhead, but who also want to take advantage of the reuse mechanisms associated with the DITA standard and the multi-channel publishing afforded by standard DITA tooling.
zh_cn: MDITA的目标用户希望以最小的开销编写结构化内容，但同时也希望利用与DITA标准相关的复用机制以及标准DITA工具提供的多渠道发布。

source: MDITA was also considered a requirement.
zh_cn: 而对 MDITA 格式的需求也被纳入考量。

source: MDITA, a Markdown3 format with a subset of XDITA elements that can be used for maximizing input readability while maintaining structure in content.
zh_cn: MDITA，一种带有 XDITA 元素子集的 Markdown 格式，可以在最大化内容可读性的同时，维护内容的结构。

source: MP: Actually, there need to be 2 different answers to that question.
zh_cn: 迈克尔·普里斯特利：实际上，这个问题需要有2个不同的答案。

source: MP: So when people say “DITA is too complex,” we want to be able to reply, “which DITA?” We have a base, which is fairly simple, and others, which have more functionality.
zh_cn: 迈克尔·普里斯特利：当大家说“DITA 太复杂了”时，我们希望可以回答这个问题，“是哪个版本的 DITA?”我们设计了一个相当简单的基础版本，以及有更多的功能技术内容版本和完整版本。

source: Management (Improving Production Efficiency).
zh_cn: 管理（提高生产效率），

source: Managing change: create change-management plan, including a communication plan, enlist change agents and champions, and define new roles and modify existing ones (Andersen, 2014, pp.
zh_cn: 管理变动：制定包括沟通计划在内的变动管理计划，谋取变动代理人和拥护者的帮助，确定新的定位并改变原有定位 (Andersen, 2014, pp.

source: Many of those moves are captured in the element types of the DITA 1.3 standard (e.g., a task is “what to do” and a concept is “what it means”).
zh_cn: DITA 1.3 标准的元素类型中能看到很多这种文步的身影（例如任务就是“步骤”而概念就是“含义”）。

source: Map (<map>) - describes the relationships among a set of resources, such as LwDITA topics
zh_cn: 地图 (<map>)描述了一组资源之间的关系，如一组 LwDITA 话题之间的关系。

source: Map Components
zh_cn: 地图组件

source: Map: a component that describes the relationships among a set of resources, such as LwDITA topics.
zh_cn: 地图（map）：描述一组资源之间关系的组件，如一组LwDITA话题之间的关系。

source: Markdown allows you to write using an easy-to-read, easy-to-write plain text format, then convert it to structurally valid XHTML (or HTML)” (Gruber, 2004).
zh_cn: Markdown 允许用户使用易于阅读、易于编写的纯文本格式进行写作，再将文本转换为结构严密的 XHTML（或 HTML）”（格鲁伯，2004）。

source: Markdown is a “text-to-HTML conversion tool for web writers.
zh_cn: Markdown 是一个“为网页端写作者提供将文本转换为 HTML 服务的工具”。

source: Marketing writers who want to contribute to DITA-based product documentation without using an XML editor
zh_cn: 希望在不使用XML编辑器的情况下对基于DITA的产品文档做出贡献的市场营销作者

source: Maybe Chef Pedro only needs a brief blurb for this information.
zh_cn: 厨师佩德罗也许只需要对特许经营权等信息做一个简短的介绍，

source: Metadata Components
zh_cn: 元数据组件

source: Michael Priestley and I are working on the Lightweight DITA technical specification, and we have the goal of having it officially released in 2019.
zh_cn: 迈克尔·普里斯特利和我正致力于编写轻量级 DITA 技术规范，我们的目标是在2019年将其正式发布。

source: Michael Priestley and I created our first LwDITA demos and test files after that article was submitted for publication; as a result, those initial five layers of abstraction are all about DITA XML.
zh_cn: 在那篇文章提交发表后，我和迈克尔·普里斯特利才创建了第一个 LwDITA 演示样本和测试文件，因此，最初的五个抽象层级都是关于 DITA XML的。

source: Michael Priestley claims that the DITA content types of concept, task, and reference are an implementation of Carroll's idea behind the minimal manual.
zh_cn: 迈克尔·普里斯特利称DITA中概念、任务和参考这三种内容类型其实是卡罗尔理念的实际应用，同样也是极简手册背后的理念。

source: Michael Priestley created the acronym XDITA in 2014, and until then all Lightweight DITA prototypes resembled what we now know as XDITA.
zh_cn: 迈克尔·普里斯特利在2014年创造了XDITA这一缩写，至此所有轻量级DITA原型才集成成我们今天所熟知的XDITA

source: Michael Priestley reiterated this expanded collection of lightweight topics at a presentation during the DITA North America/Content Management Solutions in Providence, Rhode Island.
zh_cn: 在罗德岛州普罗维登斯举行的 DITA 北美/内容管理解决方案大会上，迈克尔·普里斯特利重申了轻量级话题的扩展集合。

source: Michael Priestley, Senior Technical Staff Member and Enterprise Content Technology Strategist at IBM and known as one of DITA's “founding fathers” (Etheridge, 2016), defines Lightweight DITA (LwDITA, which should be read as “Lightweight DITA”) as a simplified schema for structuring content, with fewer elements, tighter content models and a simplified specialization architecture to define new types compared to those of DITA XML.
zh_cn: 迈克尔·普里斯特利是 IBM 高级技术人员和企业内容技术策略师，被誉为 DITA 的“创始人”（埃瑟里奇，2016年），他认为轻量级 DITA （LwDITA，全称为“Lightweight DITA”）一种创建结构化内容的简单方式，与基于 XML 的 DITA 相比，可以用更少的元素、更紧凑的内容模型和简化的专有体系结构来定义新类型。

source: Miller and Selzer analyzed rhetorical topics as repetitive but useful patterns of speech in the following paragraph:
zh_cn: 米勒和塞尔泽将修辞主题分析为一种重复但有用的讲话模式，如下所示：

source: Minimalism was one of the big influences on DITA, but I first received the influence filtered through guidelines written by others, including the editorial standards in the IBM publication Developing Quality Technical Information.
zh_cn: DITA受极简主义的影响极深，但我对这一影响力的初体验是来自于他人撰写的指导方针，其中就包括IBM出版物《开发高质量技术信息》中设定的编辑标准

source: Modular content is “intentionally designed for reuse.” Instead of page- centric books, authors of intelligent content create modules or components of content (topics) “one at a time.”
zh_cn: 模块化内容是“特地为复用而设计的”。与以页面为中心的书籍不同，智能内容创作者“一次”创建“一个”内容（话题）模块或组件。

source: More than once, I have received feedback, on the initial minutes of training after introducing this rule, saying that this rule is “slightly annoying,” but authors can see its benefits once they reuse the paragraph with the identifier of “first” in any other place where paragraphs are allowed, and not just where list items are allowed.
zh_cn: 不止一次在介绍这条规则后最初的几分钟的培训里， 我收到反馈说这个规则是“有点烦人,但是一旦作者在其他运行使用段落而不仅仅只是列表项的位置复用带有“第一”标识符的段落时，他们就能看到这条规则的好处。

source: Most LwDITA-aware tools, including Oxygen XML Editor, should take care both of the editing and processing tasks.
zh_cn: 大多数支持LwDITA的工具，包括Oxygen XML编辑器，应该同时负责编辑和处理任务。

source: Most authors probably will enter an intelligent content workflow unaware of the larger discussions on computational thinking and abstractions behind automating publication and filtering routines.
zh_cn: 大多数创作者可能在刚开始从事智能内容写作时，都没有意识到在自动化发布和过滤例程之外，业界有更多关于计算思维和抽象能力的讨论。

source: Most of the research and development work described in this report was concerned with information-mapped books.
zh_cn: 本报告中描述的大部分研究和发展工作都与信息映射书籍有关。

source: Much Ado About DITA
zh_cn: 关于 DITA 诞生的众多细节

source: Much like separating the layers of computing architecture so engineers can focus on one problem at a time, seeing the process behind intelligent content with LwDITA as a series of layers involving important, but separate, abstractions can provide a more navigable path for adoption.
zh_cn: 就像分离计算机架构层级以便工程师可以一次专注于一个问题一样，将使用LwDITA创作智能内容的过程视为一系列重要但又独立的抽象层级，这样创作会更加顺畅。

source: Multimedia Components
zh_cn: 多媒体组件

source: Musaeus et al., for example, claim that computational thinking “as part of the medical curriculum could help educate novices (medical students and physicians in training) in the analysis and design of complex healthcare organizations, which increasingly rely on computer technology.
zh_cn: 例如，穆萨乌斯等人称，计算机思维“作为医学课程的一部分，可以帮助新手（医学生和正在接受培训的医生）分析和设计复杂的医疗机构，而这些机构越来越依赖计算机技术。

source: Muted: determines if a multimedia component should have audio by default or not.
zh_cn: 静音（muted）：控制多媒体组件在默认情况下是否静音。

source: My daughter Sofia was born on September 12, 2014 and I couldn't join the subcommittee in time for its call.
zh_cn: 2014年9月12日，我的女儿索菲亚出生了，所以我没能及时加入小组委员会的电话会议。

source: My initial conversation with Priestley from April of 2014 started on the topic of evaluating the effectiveness of HDITA as a non-XML introduction to the structuring and publishing capabilities of the DITA standard.
zh_cn: 2014年4月我与Priestley进行了第一次沟通，评估将 HDITA 作为一种非 XML 的 DITA 标准格式，其结构化和发布能力的有效性。

source: My samples included a hastily assembled “MarkDITA” topic prototype that used a combination of HDITA tags with Markdown syntax to recreate a DITA task (Figure 3.2).
zh_cn: 这些示例中包括一个仓促组合的“MarkDITA”话题原型，它使用 Markdown 语法以 HDITA 标签组合重新创建了一个 DITA 任务（图3.2）。

source: NH: I thought the answer to that question was “look at lightweight DITA.”
zh_cn: 南希·哈里森：我认为可以这样回答“试试轻量级 DITA 吧”。

source: Naming the Product or Procedure
zh_cn: 给产品或流程命名

source: Navigation title (<navtitle>) - provides an alternate title for a topic that becomes a part of navigation resources or tables of contents in deliverables
zh_cn: 导航标题 (<navtitle>)为话题提供替代标题，是可交付内容中的导航资源或表格内容的一部分。

source: Navigation title: provides an alternate title for a topic that becomes a part of navigation resources or tables of contents in deliverables.
zh_cn: 导航标题（navigation title）：为话题提供替代标题，是可交付内容中的导航资源或表格内容的一部分。

source: Nevertheless, despite the potential uses of such a content blurb, the component that contains the majority of conventions for content is the body - represented in XDITA and HDITA by the tag <body>.
zh_cn: 尽管这种内容简介有许多潜在用途，用来包裹大多数内容组件的是主体——主体在 XDITA 和 HDITA 中由标签 <body> 表示。

source: Nevertheless, evolution can also be an appropriate way to describe how the DITA technical committee reacted to society and industry demands and spawned, at least in one of the standard’s evolutionary branches, LwDITA.
zh_cn: 尽管如此，要描述 DITA 技术委员会是如何响应社会和行业的需求并创造出至少是 DITA 标准进化分支之一的 LwDITA 的，进化是一个合适的词语。

source: Nevertheless, evolution can also be an appropriate way to describe how the DITA technical committee reacted to society and industry demands and spawned, at least in one of the standard's evolutionary branches, LwDITA.
zh_cn: 尽管如此，要描述 DITA 技术委员会是如何响应社会和行业的需求并创造出至少是 DITA 标准进化分支之一的 LwDITA 的，进化是一个合适的词语。

source: Nevertheless, some attempts at quantifying and documenting usage figures do exist.
zh_cn: 尽管如此，仍存在一些量化和记录用户数量的尝试。

source: Nevertheless, this is not a “learn code qua code” manifesto, and in some instances (like the use of Oxygen XML Editor as an authoring tool in Chapters 5 and 6) the actual code behind an implementation of LwDITA can be hidden in a layer of abstraction that shows a graphical user interface to a writer.
zh_cn: 然而，这不是一个“学习代码”的宣言，并且在某些情况下（如在第五章和第六章中提到的，使用 Oxygen XML Editor 作为写作工具），LwDITA 执行的实际代码可以隐藏在一个抽象层级中，只向创作者显示图形用户界面。

source: New documents need not be written for each purpose, and one single change can be reflected accurately across all the information materials produced by a given company.
zh_cn: 如今，不需要为每一个任务都编写新的文件，一个简单的改动就可以在公司产出的所有信息材料中得到精确体现。

source: New tools can enter the market providing function up to that level, and compete evenly in that space.
zh_cn: 新工具可以进入市场，提供具有市场水平的功能，并在市场中公平竞争。

source: Nine years later, Hart-Davidson (2010) noted that the technical communication literature focused narrowly on the concept of single-sourcing, to the detriment of other aspects of a content management (CM) workflow that involve technical authors.
zh_cn: 九年之后，哈特-戴维森 (2010) 注意到技术传播界的文章狭隘地关注同源开发的概念，这损害了与技术作者息息相关的内容管理 (CM) 工作流的其他方面。

source: No error message is self explanatory” (1976, p.
zh_cn: 没有任何错误信息是不言自明的” (1976, p.

source: No more copy and paste!
zh_cn: 不再需要复制和粘贴！

source: Nobody navigates that crossroad of genre and technical communication like Carolyn Miller.
zh_cn: 没有人能像卡洛琳·米勒（Carolyn Miller）那样指引着体裁和技术传播的发展方向。

source: Nobody read them.”
zh_cn: 没人会去读手册的。”

source: Nobody read them.” All this being said, and without data from every company that has adopted DITA in the world, how many of those 17 document types and 440 element types still have virtual plastic on them in the DITA specification for technical content?
zh_cn: 根本没有人读它们。”如上所述，同时也很想统计下世界上所有使用DITA的公司的数据，在这17种文档类型和440种元素类型中，有多少 DITA 技术内容文档的塑封还没有被拆过？

source: Non-English-speaking authors who want to take advantage of DITA reuse and publishing without depending on XML tags written in English
zh_cn: 希望利用DITA重用和发布而不依赖于用英语编写的XML标记的非英语作者

source: Non-English-speaking content creators who are comfortable with HTML5 semantic elements.
zh_cn: 熟悉HTML5语义元素的非英语内容创作者。

source: Not at all.
zh_cn: 不是的。

source: Note
zh_cn: 注释

source: Note that this proposal included the addition of HTML5 tags (<address> and <aside>) in XDITA to have them available in both authoring formats.
zh_cn: 值得注意的是，普里斯特利提议在XDITA中添加额外的 HTML5 标签(<address> 和 <aside>)，使其在两种写作格式中都可以使用。

source: Note: information that expands on or calls attention to a particular point.
zh_cn: 注解（note）：对某一点内容进行扩展或想要引起读者注意的信息。

source: Notes
zh_cn: 注释

source: Now it's the time to fulfill that promise.
zh_cn: 在是履行承诺的时候了。

source: Now, if Pedro were to open a text editor in his computer and start typing XML tags to structure his content, he probably would not know where to go after typing for a few minutes.
zh_cn: 现在，如果佩德罗打开电脑中的一个文本编辑器，开始键入 XML 标记创建结构化内容，几分钟后他可能就不知道接下来要做什么了。

source: O'Keefe's recipe1 features a main container element (<Recipe>), which includes several sub-elements (<Name>, <IngredientList>, and <Instructions>).
zh_cn: 奥基夫提供的菜谱示例1包括一个主包含元素（<Recipe>），该元素又包含几个子元素（<Name>， <IngredientList>和<Instructions>）。

source: Of course, you will also need all the topics that the map references (inside each <topicref> tag), but we will work with those in the next chapter.
zh_cn: 当然，你还需要创建地图引用的所有话题（即每个 <topicref> 标签里的内容），不过这将在下一章进行讲解，

source: On May 27, 2014 Michael Priestley submitted the following proposal to the DITA Technical Committee asking for the creation of a dedicated Lightweight DITA subcommittee with OASIS:
zh_cn: 2014年5月27日，迈克尔·普里斯特利向DITA技术委员会提交了以下提议，要求与 OASIS 一起创立一个专门的轻量级 DITA 小组委员会：

source: On the academic side of technical communication (and in corporate training), we have the opportunity to fill this gap in knowledge and teach about the benefits and requirements of developing an intelligent content strategy based on principles and practices of computational thinking.
zh_cn: 在技术传播领域的学术研究（以及企业培训）方面，我们有机会填补这一知识空白，教授基于计算机思维的原则和实践来开发智能内容策略的优势和要求。

source: On the contrary, scholars in the field have expanded the work of technical communication into domains and scenarios like healthcare, policy-making, and social justice, among others, that were closed to writing researchers in the recent past.
zh_cn: 相反，技术传播界的学者已经将技术传播的工作扩展到如医疗保健、政策制定和社会正义等领域，其中不乏近年来首次对写作研究者开放的领域。

source: On the other hand, producing information deliverables based on that structure (say, a webpage with a specific recipe) is not necessarily simple when implementing a custom XML content type.
zh_cn: 但利用某一特定的XML内容类型根据结构（比如特定菜谱的网页）生成可交付成果并不一定简单。

source: On the other hand, they will accept almost any outrageous restriction if it is identified and described clearly” (1976, p.
zh_cn: 另一方面，只要界定和描述足够清晰，用户愿意接受几乎任何粗暴的限制。” (1976, p.

source: Once those parts or components are tagged, they can be “assembled” in different ways for use in a variety of deliverables and media.
zh_cn: 一旦这些部件或组件被标记，它们就可以以不同的方式进行“组装”，用于各种交付物和媒介。

source: Once you have created content units in any LwDITA authoring format, you will need a software processor to transform those LwDITA topics into deliverables for human users.
zh_cn: 在以任何LwDITA创作格式创建了内容单元后，你将需要软件处理器来将这些LwDITA主题转换为供人类用户使用的可交付内容。

source: Once you have downloaded the file that corresponds to your computer's operating system, extract or decompress the file to a directory where you want to install the Open Toolkit.
zh_cn: 下载与你计算机操作系统相对应的 DITA-OT 文件后，将该文件解压到你希望安装的路径即可。

source: One could point out that the number of XML tags available in the DITA standard is the result of years of committee-based development with active members representing different sectors and industries with unique content-structuring
zh_cn: DITA标准中可用的XML标记的数量是以委员会为基础开发的结果，其活跃成员代表了不同行业和部分独特的内容架构。

source: One is Lightweight DITA, one is packaging (DITA Technical Committee, 2013).
zh_cn: 一种回答是轻量级 DITA，一种是打包技术（DITA 技术委员会，2013）。

source: One is about “applying computing ideas to facilitate computing work in other disciplines,” and another is about “applying computing ideas in daily life, completely apart from any use of computing.” He questions the ultimate promise of computational thinking and presents it as a problem of knowledge transfer.
zh_cn: 一个是“应用计算机思想来促进其他学科中的计算工作”，另一个是“在日常生活中应用计算机思维，但是完全不适用计算机”。他对计算机思维的前景提出了质疑，并将其视为一个关于知识迁移的问题。

source: One of the greater challenges to the Lightweight DITA subcommittee, as it develops the LwDITA technical specification, is to define how LwDITA tools should handle the presence of non-LwDITA HTML5 tags.
zh_cn: 轻量级DITA小组委员会在开发LwDITA技术规范时面临的一个更大的挑战是，定义LwDITA工具应该如何处理非LwDITA HTML5标记。

source: One of the key developments here is the result of ongoing discussions with Information Mapping, who are now at the point of contributing their information type definitions to the DITA TC (technical committee) for inclusion in the lightweight proposal.
zh_cn: 一个关键的进展就是与信息映射进行讨论的结果，他们现在正准备将他们的信息类型定义提交给 DITA TC（技术委员会），以便将其包含在轻量级模型的提案中。

source: One of the major features and advantages of DITA, and LwDITA, is the ability to specify and generate arbitrary collections of topic content.
zh_cn: DITA 和 LwDITA 的主要特性和优点之一是能够规定并生成话题内容的任意集合，

source: One of the many approaches I have adopted to introduce the DITA standard in a human- ities-based Professional and Technical Writing curriculum is to present those elements as rhetorical conventions of our specialized discourse community.
zh_cn: 我在专业技术写作课程中引入DITA采用的方法之一就是将这些元素作为我们专业话语社区的修辞惯例来呈现。

source: One of the most notorious characteristics of LwDITA in its initial release is that it does not include the document types of concept, task, and reference that many users associate with the Darwin Information Typing Architecture.
zh_cn: 在最初版本的 LwDITA 中，最不受欢迎的一个特征是，它不包括许多用户在 DITA 中会用到的概念（concept）、任务（task）和引用（reference）文档类型。

source: One of the solutions that came out of those explorations at IBM was the Darwin Information Typing Architecture.
zh_cn: IBM 探索出来的解决方案之一是DITA，达尔文信息类型架构。

source: One subject, signified by the title
zh_cn: 一个主题对应一个标题

source: Opportunities for practice and research abound across the spectrum of modern content-development lifecycles, which provide the foundation for the layers of abstraction behind authoring and publishing workflows with LwDITA.
zh_cn: 在现代内容开发的生命周期中，存在大量实践和研究的机会，这为使用 LwDITA 编写和发布工作流背后的抽象层级奠定了基础。

source: Or are they?
zh_cn: 或者就是一样的？

source: Ordered list environment in HDITA.
zh_cn: HDITA 中的有序列表组件。

source: Ordered list: a series of items sorted by sequence or order of importance.
zh_cn: 有序列表（ordered list）：按顺序或重要性排序的一系列项目。

source: Ordered lists
zh_cn: 有序列表

source: Organization
zh_cn: 组织架构

source: Other recommendations, however, were standard guidelines for technical writers.
zh_cn: 然而，其他的建议是技术作者的标准指南。

source: Other elements, like <lcObjective> for a single learning objective or <lcDelivery> for delivery method of educational content, are peculiar to the DITA learning and training specialization.
zh_cn: 其他元素，如<lcObjective> 对于单一的学习目标，或<lcDelivery> 对于教育内容的传达方式，是DITA学习和培训专业化所特有的。

source: Other lines of discussion in the early months of the subcommittee focused on the authoring formats to include in an initial release of the LwDITA standard.
zh_cn: 小组委员会成立后前几个月的讨论还集中在 LwDITA 标准初始版本中要包含的写作格式上，

source: Our Obsession with Order and Rules
zh_cn: 痴迷于秩序与规则

source: Our work with the preliminary HDITA format was eventually published as the article “Structured Authoring without XML: Evaluating Lightweight DITA for Technical Documentation” in the journal Technical Communication (Evia & Priestley, 2016).
zh_cn: 关于 HDITA 格式的初步探究写在《不使用 XML 的结构化创作:为技术文档评写作估轻量级 DITA》（Structured Authoring without XML: Evaluating Lightweight DITA for Technical Documentation）一文中，该文最终发表在《技术传播》（Technical Communication）杂志上。（艾维亚和普里斯特利，2016年）。

source: Out of the box mappings and specifications for authoring these topic types in other formats, such as HTML5 or markdown
zh_cn: 轻松地实现其他格式（如 HTML5 或 Markdown）的话题类型的映射和专门化，开箱即用

source: Over the years, since Michael Priestley developed the original idea for HDITA in 2014, the Lightweight DITA subcommittee at OASIS has identified the following potential users for an HTML5-based version of the proposed standard:
zh_cn: 自2014年迈克尔·普里斯特利提出了HDITA的最初想法以来，OASIS的轻量级DITA小组委员会已经为基于HTML5版的提议标准确定了以下潜在用户：

source: Oxygen validates the XDITA topics as the authors develop them.
zh_cn: Oxygen 在写作者创建 XDITA 话题时进行验证，

source: PREFACE
zh_cn: 前言

source: Paragraph: a unit of text that expresses a single main idea.
zh_cn: 段落（paragraph）：表达某一主要思想的文本单元。

source: Part of that responsibility will be met through formal education.
zh_cn: 其中部分通过正规教育教授。

source: Particularly, the course content he developed for the ELI Review modules on The Essential Moves of Technical Communication (Eli Review, n.d.) is based on common traits of technical communication genres.
zh_cn: 尤其是 《技术传播基本文步》 (Eli Review, n.d.)中为ELI Review模块开发的课程内容就是基于技术传播体裁的通用特质。

source: Pedro could buy a software package to structure his recipes and create an online cookbook; however, in a previous stage of his career he was involved in a marketing project that depended on a commercial application.
zh_cn: 佩德罗可以购买一个软件包来结构化菜谱、创建一个在线菜谱网页；但是在他职业生涯前期，他参与了一个依赖商业软件的营销项目。

source: People didn't read them.
zh_cn: 用户并不会去阅读手册。

source: People didn’t read them.
zh_cn: 用户并没有阅读手册。

source: Phrase
zh_cn: 词组

source: Phrase: a piece of text that is associated with a specific purpose.
zh_cn: 短语（phrase）：与特定主旨相关的短语。

source: Plain-text aficionados
zh_cn: 纯文本爱好者

source: Please note that details might change between this writing and the actual release of the Lightweight DITA standard.
zh_cn: 值得注意的是本书与实际发布的轻量级DITA标准在细节上存在差异。

source: Poster: a link to an image or static video frame.
zh_cn: 海报（poster）：图像或静态视频的链接。

source: Potential users of MDITA include the following:
zh_cn: MDITA的潜在用户如下所示：

source: Preface (“less than 1 page”).
zh_cn: 前言 (“不多于1页”).
